# f(x(t)), y(t) = 0  
# <=> функция x = u(t)
#             y = o(t)
# (t) - некоторый параметр 
# (x(t)) - параметрическое задание
#           x = u(t) - некоторые параметрические функции
#           y = o(t)


# y = kx + b <=> функция x = t
#                        y = kt + b 
# Параментризация функции 
# функция x = t * K
#         y = k^2 * t + b 
# Параментризация функции 
# Важно! Параментризация должна упрощать жизнь 
# x^2 + y^2 = R^2 - уравнение окружности
# функция x = R*cos(t)
#         y = R*sin(t)
# Проверка!
# Подставим x и y в начальное уравнение x^2 + y^2 = R^2
# (R*cos(t))^2 + (R*sin(t))^2 = R^2
# и получаем тождественное уравнение


# (x^2/a^2) + (y^2/b^2) = 1
#  функция x = a * cos(t)
#          y = b * sin(t)

