print("«Шляпка гриба, покрытая … кожиц..й, держится на … ножк.. . Снизу шляпка затянута … плёнкой. Когда её уберёшь, откроется нижняя … сторона шляпк.. .»")
a = input("Вставьте пропушенное слово : покрытая ...")#темно-коричневой
b = input("Вставьте пропушенную букву:кожиц..й ") # кожицей
c = input("Вставьте пропушенное слово : держится на...")#крепкой
d = input("Вставьте пропушенную букву: ножк..")#ножке    
r = input("Вставьте пропушеннуое слово: затянута ...")#белой 
z = input("Вставьте пропушенное слово : откроется нижняя...") #нижняя желтоватая
v = input("Вставьте пропушенную букву: шляпк.. ") #шляпки
print("Шляпка гриба, покрытая",a,"кожиц",b,"й","держится на",c,"ножк",d,".","Снизу шляпка затянута",r,"пленкой.Когда ее уберешь, октроется нижняя",z,"сторона шляпк",v)